testing-network-throughput-using-iperf3.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-04-04 Wed 13:43 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>用iperf3测试网络吞吐量</title>
<meta name="generator" content="Org mode">
<meta name="author" content="md11235">
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="preamble" class="status">
<p class="date">Published: </p>
</div>
<div id="content">
<h1 class="title">用iperf3测试网络吞吐量</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7eefb37">1. Server side</a></li>
<li><a href="#org15d353b">2. Client side</a></li>
</ul>
</div>
</div>


<div id="outline-container-org7eefb37" class="outline-2">
<h2 id="org7eefb37"><span class="section-number-2">1</span> Server side</h2>
<div class="outline-text-2" id="text-1">
<p>
iperf3 -s 0.0.0.0
</p>

<ol class="org-ol">
<li>In a terminal session on the first padb node (10.0.0.5) start the iperf server</li>
</ol>
</div>
</div>


<div id="outline-container-org15d353b" class="outline-2">
<h2 id="org15d353b"><span class="section-number-2">2</span> Client side</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>in a second terminal session on the second padb node, start the iperf client.</li>
</ol>

<ol class="org-ol">
<li>When the test has completed, kill the iperf server using ctrl+c</li>
</ol>

<p>
./iperf3 &#x2013;client node5.imlab.lan &#x2013;bandwidth 0 -R &#x2013;length 8900 -n 1000M &#x2013;udp &#x2013;port 5201 &#x2013;parallel 1 &#x2013;title '(1)~10Gb udp@8900: .6-&gt;.5' | tee /tmp/iperf3.$(date +%Y%m%d_%H%M).out</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: md11235 (<a href="mailto:md11235@gmail.com">md11235@gmail.com</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.50 (<a href="http://orgmode.org">Org</a> mode 9.1.6)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>